CCS2.0/Web References/CompuscanService/NormalSearchService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webServices/" name="NormalSearchService" targetNamespace="http://webServices/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://webservices.compuscan.co.za/NormalSearchService?xsd=1" namespace="http://webServices/" />
    </xsd:schema>
  </types>
  <message name="PingServer">
    <part name="parameters" element="tns:PingServer" />
  </message>
  <message name="PingServerResponse">
    <part name="parameters" element="tns:PingServerResponse" />
  </message>
  <message name="DoNormalEnquiry">
    <part name="parameters" element="tns:DoNormalEnquiry" />
  </message>
  <message name="DoNormalEnquiryResponse">
    <part name="parameters" element="tns:DoNormalEnquiryResponse" />
  </message>
  <portType name="NormalSearchService">
    <operation name="PingServer">
      <input message="tns:PingServer" />
      <output message="tns:PingServerResponse" />
    </operation>
    <operation name="DoNormalEnquiry">
      <input message="tns:DoNormalEnquiry" />
      <output message="tns:DoNormalEnquiryResponse" />
    </operation>
  </portType>
  <binding name="NormalSearchServicePortBinding" type="tns:NormalSearchService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="PingServer">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="DoNormalEnquiry">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="NormalSearchService">
    <port name="NormalSearchServicePort" binding="tns:NormalSearchServicePortBinding">
      <soap:address location="https://webservices.compuscan.co.za/NormalSearchService" />
    </port>
  </service>
</definitions>